[
  {
    "id": "4c12c4ba-6f8b-4bb8-a4f2-bc8e32101e20",
    "companyName": "TechNova Solutions",
    "position": "Développeur Backend",
    "description": "Responsable du développement d'API backend robustes et évolutives pour des applications d'entreprise.",
    "startDate": "2023-06-10",
    "endDate": "2024-03-30",
    "contractType": "CDD",
    "location": "Antananarivo",
    "tasks": [
      "Développement et gestion d'API REST avec EXPRESSJS.",
      "Conception et optimisation de bases de données SQL.",
      "Gestion des performances du backend sous NODEJS.",
      "Implémentation de solutions de mise à l'échelle pour les applications critiques.",
      "Développement d'une API permettant de traiter 5000 requêtes par minute.",
      "Optimisation des bases de données, réduisant le temps de requête de 40%.",
      "Amélioration de la stabilité du système avec une mise à l'échelle horizontale."
    ],
    "technologiesUsed": [
      "JAVASCRIPT",
      "NODEJS",
      "EXPRESSJS",
      "MySQL",
      "DOCKER"
    ],
    "createdAt": "2025-02-01T08:23:10Z"
  },
  {
    "id": "ef2b3da9-4684-41de-b181-e5899071ade2",
    "companyName": "ITRAS Group",
    "position": "Stagiaire Développeur Full-Stack",
    "description": "Participation au développement d'applications web complètes, de la conception à la mise en production.",
    "startDate": "2023-09-21",
    "endDate": "2024-05-06",
    "contractType": "Stage",
    "location": "Nanisana",
    "tasks": [
      "Développement de fonctionnalités Frontend et Backend.",
      "Intégration d'API REST avec NODEJS et NESTJS.",
      "Optimisation des performances des applications web.",
      "Mise en place de conteneurs DOCKER pour l'environnement de développement.",
      "Développement et déploiement d'une application web en production.",
      "Réduction du temps de réponse des API de 30%.",
      "Amélioration de l'automatisation du déploiement avec DOCKER Compose."
    ],
    "technologiesUsed": [
      "JAVASCRIPT",
      "NODEJS",
      "REACTJS",
      "NEXTJS",
      "NESTJS",
      "DOCKER"
    ],
    "createdAt": "2025-02-25T08:23:10Z"
  },
  {
    "id": "625a9b84-d827-4327-ab32-f1252efdb1ff",
    "companyName": "ITRAS Group",
    "position": "Développeur Web Full-Stack (Junior)",
    "description": "Responsable du développement et de la maintenance des applications web en environnement Full-Stack.",
    "startDate": "2024-05-06",
    "endDate": "",
    "contractType": "CDI",
    "location": "Nanisana",
    "tasks": [
      "Développement de nouvelles fonctionnalités et maintenance des plateformes existantes.",
      "Optimisation des performances du backend sous NODEJS.",
      "Intégration et gestion des conteneurs DOCKER pour les environnements de production.",
      "Collaboration avec l'équipe pour concevoir des solutions évolutives et robustes.",
      "Mise en œuvre de solutions scalables pour une augmentation de 40% de l'efficacité du système.",
      "Optimisation des requêtes API, réduisant le temps de réponse de 25%.",
      "Automatisation du processus de déploiement via DOCKER."
    ],
    "technologiesUsed": [
      "JAVASCRIPT",
      "NODEJS",
      "REACTJS",
      "NEXTJS",
      "NESTJS",
      "DOCKER",
      "GIT",
      "POSTGRESQL"
    ],
    "createdAt": "2025-02-12T08:23:10Z"
  }
]
